{"intents": [
        {"tag": "greeting",
        "patterns": ["สวัสดี","หวัดดี","เป็นไงบ้าง","โย่ว","ว่าไง"],
        "responses": ["สวัสดี ผมคือ chatbot ของ E-portfolio นี้ หากมีอะไรสงสัยสามารถถามผมได้เลยนะครับ <3","สวีดัส สวัสดีครับ ผมมีหน้าที่ตอบคำถามต่างๆเกี่ยวกับ E-portfolio นี้ หากมีอะไรอยากถามสามารถถามผมได้เลยนะครับ"],
        "context_set":""
        },
        {"tag": "introduce",
        "patterns": ["แนะนำตัวหน่อย","อธิบายเกี่ยวกับตัวเอง","คิดว่าตัวเองเป็นยังไง","อธิบายตัวเองโดยย่อ","แนะนำตัวหน่อยได้มั้ยครับ"],
        "responses": ["ถ้าคุณหมายถึงเจ้าของของผม เขาชื่อ ธนกร พงศ์มานะชัย ชื่อเล่นชื่ออ๊อฟเป็นคนที่ชอบเข้าสังคมแต่บางครั้งก็อยากอยู่คนเดียวเพราะพลังงานหมด ชอบในการcodingและการสร้างสรรค์ผลงานต่างๆแต่รู้ตัวช้าไปหน่อยเลยปั่นงานนี้แบบไฟลุก ชอบเล่นดนตรีและเล่นเกมเป็นงานอดิเรก แต่งเพลงได้ด้วยนะ อ๊อฟเป็นคนที่เริ่มทำอะไรค่อนข้างยากแต่หากเริ่มแล้วจะไปต่อจนจบงานเลย เป็นคนขี้เกียจ เพราะขี้เกียจดองงานเลยทำงานให้เสร็จด้วยความไวแสง คร่าวๆก็มีประมาณนี้แต่หากอยากรู้เพิ่มเติมต้องลองสัมภาษณ์ด้วยตัวเองแล้วล่ะครับ ^ ^"],
        "context_set":""
        },
        {"tag": "strong point",
        "patterns": ["จุดแข็งของตัวเอง","อะไรคือสิ่งที่คุณคิดว่าเป็นข้อดีของตัวเอง","ขอข้อดีหรือจุดแข็งของคุณหน่อย","จุดแข็ง"],
        "responses": ["อ๊อฟเป็นคนอัธยาศัยดี เข้ากับคนอื่นได้ง่าย ให้คำปรึกษาเพื่อนในเรื่องต่างๆที่มีประสบการณ์ได้ ชอบแก้ปัญหาหาคำตอบ ชอบหาความรู้ใหม่ๆให้ตัวเองก็เลยนั่งฟังข่าวสาร technology จากช่อง 9arm และ techcast ทุกวัน เป็นคนใจเย็นมากๆ ตัดสินเด็ดขาด ทัศนคติดี เข้าใจคนรอบตัวและอ่านบรรยากาศรอบๆข้างได้ดี โกรธยาก ถึงโกรธก็ไม่โกรธนาน"],
        "context_set":""
        },
        {"tag": "weak point",
        "patterns": ["จุดอ่อน","คิดว่าตัวเองมีข้อเสียมั้ย","แล้วข้อเสียของคุณล่ะ","จุดอ่อนของคุณคืออะไร","จุดอ่อน"],
        "responses": ["ข้อเสียของอ๊อฟคือ เป็นคนขี้เกียจทำให้การทำงานบางครั้งมาปั่นเอาตอนใกล้ๆ dead line แต่ก็ยังทำเสร็จนะ เป็นคนหมด passion ง่ายแต่ก็ฟื้นไว บางครั้งก็ลืมคิดก่อนทำจนเกิดปัญหาขึ้น เวลามีอะไรที่มาดึงความสนใจจะชอบลืมตัวเองแล้ววางสิ่งที่ทำอยู่แล้วไปทำสิ่งที่สนใจ บางครั้งก็แบ่งเวลาในแต่ละวันไม่ลงตัว ชอบพังตารางาสิ่งที่จะทำในแต่ละวัน"],
        "context_set":""
        },
        {"tag": "motivation",
        "patterns": ["แรงบัลดาลใจในการเข้าคณะนี้","ทำไมถึงอยากเข้าคณะนี้","ทำไมอยากเข้าที่นี่","เหตุผลที่อยากเข้าคณะนี้","ทำไมถึงอยากเรียน"],
        "responses": ["อ๊อฟเป็นคนที่ชอบตั้งคำถามกับสิ่งรอบตัวและชอบที่จะหาคำตอบและแก้ปัญหาจนได้คำตอบจึงสนใจในคณะวิศวกรรมศาสตร์ หากต้องการดูรายละเอียดเพิ่มเติมสามารถดูได้ที่หน้า ()"],
        "context_set":""
        },
        {"tag": "best",
        "patterns": ["ผลงานที่ชอบที่สุด","ผลงานที่ดีที่สุด","The best activity","ภูมิใจในงานใดที่สุด"],
        "responses": ["ผลงานที่ภูมิใจที่สุดของอ๊อฟคือการสร้างเกม BunTong! เพราะเป็นงานที่อ๊อฟมีความตั้งใจมากๆและเป็นการสานฝันวัยเด็กของอ๊อฟด้วย"],
        "context_set":""
        },
        {"tag": "why best",
        "patterns": ["ทำไมถึงชอบผลงานนี้","เพราะอะไรถึงชอบผลงานนี้","ภูมิใจในงานนี้ที่สุดเพราะอะไร"],
        "responses": ["เพราะว่าการสร้างเกม BunTong! มีความท้าทายมากเพราะนอกจากจะต้องมีความรู้ด้าน Coding แล้ว จะต้องใช้ความสามารถในการ Desgin ตัวละคร, User interface, sound effect & background music และความคิดสร้างสรรค์ในการคิด theme ของเกมขึ้นมา"],
        "context_set":""
        },
        {"tag": "what best",
        "patterns": ["สิ่งที่ได้จากผลงานนี้","ได้อะไรจากการทำงานนี้บ้าง"],
        "responses": ["ได้ฝึกการเขียนภาษา C# และ การใช้ Unity Engine ได้ใช้ความคิดสร้างสรรค์อย่างเต็มที่ ได้ฝึกแก่ปัญหาที่เกิดขึ้นและได้ฝึกบริหารเวลาในการทำงาน"],
        "context_set":""
        },
        {"tag": "where",
        "patterns": ["ถ้าเป็นไปได้อยากเข้าที่ไหน","อยากได้มหาลัยไหน","เล็งที่ไหนไว้อยู่"],
        "responses": ["อ๊อฟชอบจุฬาลงกรณ์มหาวิทยาลัยและสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบังในระดับที่เท่าๆกัน ที่ชอบจุฬาลงกรณ์มหาวิทยาลัยเพราะว่าอ๊อฟเคยได้ไปค่าย Larngear ครั้งที่22 และค่ายนี้ทำให้อ๊อฟชอบในคณะวิศกรรมของจุฬาลงกรณ์มหาวิทยาลัยและชอบบรรยากาศของที่นี้ขึ้นมา ส่วนที่อ๊อฟชอบสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบังนั้นเพราะว่าอ๊อฟมีคนรู้จักเรียนอยู่ที่นั้นเยอะมากและเคยได้ไปทัวร์ข้างในตัวมหาวิทยาลัยโดยมีพี่ที่สนิทด้วยพาไปถึงจะไม่มีโอกาสได้ไปค่ายของที่นี่แต่อ๊อฟก็ชอบในตัวมหาวิทยาลัยนี้"],
        "context_set":""
        }
    ]
}